demo/load-test.yml
config:
  target: "{{ $processEnvironment.webAppUrl }}"
  phases:
    - duration: 300
      arrivalRate: 2
      name: "Warm up - 2 req/s"
    - duration: 300
      arrivalRate: 5
      rampTo: 10
      name: "Ramp to 10 req/s"
    - duration: 300
      arrivalRate: 10
      name: "Sustained - 10 req/s"
  variables:
    productIds: [1, 2, 3, 4, 5]
    regions: ["US", "EU", "APAC"]
  processor: "./load-processor.js"

scenarios:
  - name: "Web App Load Test"
    exec:
      - flow:
          - get:
              url: "/"
              expect:
                - statusCode: 200
              capture:
                json: "$.appVersion"
                as: "version"
          
          - think: 2
          
          - get:
              url: "/health"
              expect:
                - statusCode: 200
          
          - think: 1
          
          - post:
              url: "/api/orders"
              json:
                productId: "{{ productIds[0] }}"
                quantity: 2
                region: "{{ regions[0] }}"
              expect:
                - statusCode: 201
              capture:
                json: "$.orderId"
                as: "orderId"
          
          - think: 3
          
          - get:
              url: "/api/orders/{{ orderId }}"
              expect:
                - statusCode: 200
          
          - think: 1
          
          - get:
              url: "/error"
              expect:
                - statusCode: [500, 502]
              match:
                  json: "$.message"
                  value: "Internal Server Error"